package class_2022_09_4_week;

// 来自美团
// 笔试第5题
// 有三个题库A、B、C，每个题库均有n道题目，且题目都是从1到n进行编号
// 每个题目都有一个难度值
// 题库A中第i个题目的难度为ai
// 题库B中第i个题目的难度为bi
// 题库C中第i个题目的难度为ci
// 小美准备组合出一套试题，试题共有三道题，
// 第一题来自题库A，第二题来自题库B，第三题来自题库C
// 试题要求题目难度递增，且梯度不能过大
// 具体地说，第二题的难度必须大于第一题的难度，但不能大于第一题难度的两倍
// 第三题的难度必须大于第二题的难度，但不能大于第二题难度的两倍
// 小美想知道在满足上述要求下，有多少种不同的题目组合
//（三道题目中只要存在一道题目不同，则两个题目组合就视为不同
// 输入描述 第一行一个正整数n, 表示每个题库的题目数量
// 第二行为n个正整数a1, a2,...... an，其中ai表示题库A中第i个题目的难度值
// 第三行为n个正整数b1, b2,...... bn，其中bi表示题库B中第i个题目的难度值
// 第四行为n个正整数c1, c2,...... cn，其中ci表示题库C中第i个题目的难度值
// 1 ≤ n ≤ 20000, 1 ≤ ai, bi, ci ≤ 10^9。
public class Code02_ExaminationPaperWays {

}
