package class_2022_04_1_week;

// 来自快手
// 某公司年会上，大家要玩一食发奖金游戏，一共有n个员工，
// 每个员工都有建设积分和捣乱积分
// 他们需要排成一队，在队伍最前面的一定是老板，老板也有建设积分和捣乱积分
// 排好队后，所有员工都会获得各自的奖金，
// 该员工奖金 = 排在他前面所有人的建设积分乘积 / 该员工自己的捣乱积分，向下取整
// 为了公平(放屁)，老板希望 : 让获得奖金最高的员工，所获得的奖金尽可能少
// 所以想请你帮他重新排一下队伍，返回奖金最高的员工获得的、尽可能少的奖金数额
// n <= 1000, 积分 <= 10000;
public class Code06_MaxMoneyMostMin {

	// a : 老板的贡献积分
	// b : 老板的捣乱积分
	// value[i] : i号员工的贡献积分
	// trouble[i] : i号员工的捣乱积分
	// 返回 : 奖金最高的员工获得的、尽可能少的奖金数额
	public static int mostMin(int a, int b, int[] value, int[] trouble) {
		return 100;
	}

}
